{
  "TESTERS": {
    "T1": {
      "ParticipantId": "T1",
      "Strategy1": {
        "ChallengingToWork": "\nLine # 17: \"Change the desired style to have higher precedence or the shown style to have lower precedence, or change the inheritance structure\" has 2 branches of action but it is not specified when which condition should be selected and perform. \nStatement \"return done\" is used to terminate the strategy, but it seems not telling the user if they finished successfully or cannot find the bug. ",
        "Clarity": "Its clear, but some sentences are a bit confusing at the first step. For instance \" Move to the portion of the page with the bug\" is a bit confusing what exactly it asked me to do. Maybe using clear keywords helps reducing ambiguity. For instance it can be transcribed as \"Navigate to the elements with defective appearance\"",
        "Missing": "The strategy just works for one defect at a time. For the pages that have more than one defective style feature, the user should rerun the strategy from the beginning. Maybe having a loop to run the strategy on all the defective elements in a list might be helpful",
        "OtherChallenges": "Some strategy statements are very general and have many substeps inside them. Maybe having break the big step to small steps may help easier following the strategy without missing any point. \nThe strategy needs a better approach to tell the user if they finished successfully or they should redo the strategy. \nStrategy is not very comprehensive and is just for one defect fixing at a time",
        "StrategyId": "Pilot9",
        "requiredInfo": "Having a method to keep variables and list."
      },
      "Strategy2": {
        "ChallengingToWork": "There are many variables in the strategy that were confusing and hard to follow. For example defining 'irregularComponent' seems redundant.\n",
        "Clarity": "Not in the first glance. Initially I assumed the task is to fix the bugs. So I was looking for ‘fixing’ statements. Aside that, Still I am not sure why in Strategy createErrorHandleCase the variable allErrors' is getting values, specially when the strategy is returning nothing at the end. \n",
        "Missing": "The type of output from each strategy. It was not clear what is the outcome of each strategy/sub-strategy. Adding that information on top of the strategy as a comment will help.\n",
        "OtherChallenges": "None.",
        "RequiredInfo": "I got lost in the strategy mainly because it was hard to distinguish the comment and the statement specially that the natural language is also used in the statements. Using a different coloring or font helps. The same argument holds for strategy calls and variable names.",
        "StrategyId": "Pilot8"
      },
      "Task1": "CssDebuggingTask",
      "Task2": "ErrorHandlingTask",
      "Time": "15:18:22",
      "WorkExperiences": {
        "biggestSoftware": "Bank transaction management application. The app includes querying form database, processing, applying calculations and visualizing data.",
        "biggestWebApplication": "Bank transaction management web base application. The app includes querying form database, processing, applying calculations and visualizing data.",
        "softwareDevelopmentExperience": "8",
        "webDevelopmentExperience": "3",
        "webExperiencePeriod": "2 years and 0 months",
        "workExperiencePeriod": "7 years and 0 months"
      }
    },
    "T2": {
      "ParticipantId": "T2",
      "Strategy1": {
        "ChallengingToWork": "slhfdnassf",
        "Clarity": " you think the strategy you used is clear? If not, please specify what was confusing or ambiguous.\n\n",
        "Missing": "In as much detail as you can remember, please tell us about each of the challenges you experienced as you used this strategy. Please try to share with us what you found to be most difficult in understanding and using the strategy. For each difficulty, be as specific as possible in describing what you wanted to do and what made this hard for you to accomplish.\n\n",
        "OtherChallenges": " you think the strategy ys of challenges you faced which is not asked above, if any.\n\n",
        "StrategyId": "Pilot9",
        "requiredInfo": "dditional information, details, or features would make it easier for you to follow this strategy?"
      },
      "Strategy2": {
        "ChallengingToWork": "otherChallenges",
        "Clarity": "its not cleare at all",
        "Missing": "In as much detail as you can remember, please tell us about each of the challenges you experienced as you used this strategy. Please try to share with us what you found to be most difficult in understanding and using the strategy. For each difficulty, be as specific as possible in describing what you wanted to do and what made this hard for you to accomplish.\n\n",
        "OtherChallenges": "its context relevant",
        "RequiredInfo": "Additional",
        "StrategyId": "Pilot3"
      },
      "Task1": "CssDebuggingTask",
      "Task2": "ProfilerTask",
      "Time": "23:4:2",
      "WorkExperiences": {
        "biggestSoftware": "5",
        "biggestWebApplication": "5",
        "softwareDevelopmentExperience": "5",
        "webDevelopmentExperience": "5",
        "webExperiencePeriod": "5 years and 5 months",
        "workExperiencePeriod": "5 years and 5 months"
      }
    },
    "T4": {},
    "Tester1": {
      "ParticipantId": "Tester1",
      "Strategy1": {
        "ChallengingToWork": "Line #2 just says you may point to the component. Instead, it could be specific to click ctrl+shift+C to inspect the highlighted element. Doing this would show the respective element in the styles tab where we can quickly make changes. ",
        "Clarity": "I felt it was clear because I am very much familiar with using this mechanism in the browser. Steps are pretty clear but adding more specifications like I mentioned in my first question’s comment would help.",
        "Missing": "Not sure if I am right. Here is my observation. Some instructions on how to look for particular element to inspect was missing. I thought that would be clear if you said in Point 2 that, use the arrow in the Inspect element window to select particular element.",
        "OtherChallenges": "NA",
        "RequiredInfo": "I think it has everything covered. Pre-conditions, Post-conditions(if necessary) and notes of what a keyword means. So it looks good. ",
        "StrategyId": "Auth3"
      },
      "Strategy2": {
        "ChallengingToWork": "The steps to be followed were precise and easy to follow and I did not have any difficulty getting through the process. I liked the Line 22 how it explains what we are actually looking for. The preconditions part were apt to move forward with the task. ",
        "Clarity": "Very much Clear",
        "Missing": "Nothing. The details were pretty straight forward. I had never used Performance profile when I inspect element but was clear when I followed the steps. ",
        "OtherChallenges": "I did not know how to use Performance profiler so I had difficulties figuring out the current frame state, network requests, animations but when I followed it twice, I was able to get to it. ",
        "RequiredInfo": "Nothing. I think it provided with all the details needed to look at the performance. ",
        "StrategyId": "Auth5"
      },
      "Task1": "CssDebuggingTask",
      "Task2": "ProfilerTask",
      "Time": "13:11:56",
      "WorkExperiences": {
        "background": "I have worked for about 4 years in the industry in technologies like ColdFusion, HTML5, CSS, Bootstrap, JQuery, JavaScript, Ajax. In my Master's, I am working on creating web applications using Node.js, Java, Bootstrap, HTML5. \n\nGit Hub: https://github.com/Bhargavicm ",
        "biggestSoftware": "https://www.healthcaresource.com/pm10ncu_m/index.cfm?fuseaction=search.categoryList&template=dsp_job_categories.cfm\n\nAbove is the demo website. I was part of building the majority of the features for the Job Portal for Hospitals across the US. I worked from India to construct a website that was mobile-friendly using Bootstrap, CSS, and JavaScript.  ",
        "biggestWebApplication": "There are two biggest web applications that I worked on\n1) Job Portal for the Hospital staffing.\n2) VMWare e-learning and Certifications module. \n\nBoth were built using ColdFusion 5. I helped them to migrate from ColdFusion 5 to ColdFusion 2016 along with a Mobile solution to web applications with advanced features. ",
        "softwareDevelopmentExperience": "3",
        "webDevelopmentExperience": "3",
        "webExperiencePeriod": "4 years and 0 months",
        "workExperiencePeriod": "4 years and 0 months"
      }
    },
    "Tester10": {
      "ParticipantId": "Tester10",
      "Strategy1": {
        "ChallengingToWork": "Precondition for having IDE extension but doesn't specify specific CSS extension on line 4\n",
        "Clarity": "Insalling git\nLogin into github account\nInstall favorite IDE\nInstall IDE extensions for CSS debug \nSetup prefer debug environment\nOpen files into IDE\nExtension integrated into debug have specific way of debugging issues, would require set of features\n    To debug CSS style\n    To highlight, add notations, add comments where the issues are\n    To view CSS live data with live feedback or solution \n\nMost of the strategy instructions were pretty clear, however, some lines such as line 5 could have been more specific\n",
        "Missing": "Insalling git\nLogin into github account\nInstall favorite IDE\nInstall IDE extensions for CSS debug \nSetup prefer debug environment\nOpen files into IDE\nExtension integrated into debug have specific way of debugging issues, would require set of features\n    To debug CSS style\n    To highlight, add notations, add comments where the issues are\n    To view CSS live data with live feedback or solution",
        "OtherChallenges": "None",
        "RequiredInfo": "Information about what specific extension to install, but the list of features they describe was adequate for me to find an appropriate extension to install\nDetails about how to address the status of each issue\nUsing more of the syntax with Roboto, such as IF, SET, RETURN commands",
        "StrategyId": "Auth6"
      },
      "Strategy2": {
        "ChallengingToWork": "Install IDE\nImport code base for ErrorHandling\nSTRATEGY ErrorHandling()\n    Add checks for possible error scenarios. Example null pointer exception or out of bounds exception\n          # This line was not very specific and I didn't really know what I should have been looking for in terms of \"possible error scenarios\"\n    Implement a logical flow to notify stakeholders in case of error situation\n          # In order to implement a logical flow the expert's strategy and wording might have been lost on more beginner programmers\n    Write the statements that should get executed regardless of any error scenario \n          # Again, I feel that this statement could be more specific and is difficult for beginner programmers to understand\n",
        "Clarity": "The strategy is not very clear as it is not very specific in terms of what part of the code to check or how to implement certain strategies such as a \"logical flow\".",
        "Missing": "Install IDE\nImport code base for ErrorHandling\nSTRATEGY ErrorHandling()\n    Add checks for possible error scenarios. Example null pointer exception or out of bounds exception\n    Create a breakpoint in foreach loops and test the bounds\n    Implement a logical flow to notify stakeholders in case of error situation\n    Write the statements that should get executed regardless of any error scenario\n    \n",
        "OtherChallenges": "none",
        "RequiredInfo": "Additional details about what it means to \"implement a logical flow\" and creating the statements for each error scenario would make it easier to follow this strategy. Also if the expert had defined their terms better it would be easier to follow in a step-by-step manner. ",
        "StrategyId": "Auth8"
      },
      "Task1": "CssDebuggingTask",
      "Task2": "ErrorHandlingTask",
      "Time": "17:54:39",
      "WorkExperiences": {
        "background": "I have years of experience in my classes implementing software applications in Java and Python. I also have created several websites using React, Firebase, and Javascript. My work at my internship with Mist systems involved creating an AI-based interactive program with APs for the company.\n\nFinal school year project:\nhttps://info340d-au18.github.io/project-moffotto/index.html#/",
        "biggestSoftware": "Slack bot for my internship involving wifi access points that use AI to interpret messages from each server and outputs data according to user input. Allows for users to pinpoint problems and update software remotely using Slack commands. ",
        "biggestWebApplication": "Web application for medical researchers and bio engineers to use scientific tools and formulas for research and projects. Included dynamic and responsive webpage with ability to store information using React and Firebase. ",
        "softwareDevelopmentExperience": "3",
        "webDevelopmentExperience": "5",
        "webExperiencePeriod": "3 years and 0 months",
        "workExperiencePeriod": "1 years and 3 months"
      }
    },
    "Tester11": {
      "ParticipantId": "Tester11",
      "Strategy1": {
        "ChallengingToWork": "I was able to understand this strategy and task as I used the similar strategy \"hovering over the defected html element\" using inspect element. It usually helps identifying and resolving the CSS issue. ",
        "Clarity": "Yes it was clear to me.",
        "Missing": "To me this task was well explained.",
        "OtherChallenges": "None.",
        "RequiredInfo": "A visual representation of an element will make it easier and faster way for me to understand things. ",
        "StrategyId": "Auth14"
      },
      "Strategy2": {
        "ChallengingToWork": "I had hard time understanding the strategy such as whats my task or what strategies I need to follow. It was little confusing for me. The reason about not understanding the task is not having a prior experience in analyzing the performance. I tried testing using Jmeter tool for one of the web application which I developed using React js. I was unable to setup it correctly.  ",
        "Clarity": "It was not clear to me as I mentioned above. I was loosing the context as I was reading more. Too many different things to catch up and this can be because of no prior knowledge in analyzing the performance of web applications.  ",
        "Missing": "In the expert strategy section, there are two points explained. Its not clear are they related to each other or both are different things.",
        "OtherChallenges": "It seems an easy task but I was unable to understand it clearly. ",
        "RequiredInfo": "I would say a detail example for performing this task would be helpful for students like me who develop applications but didn't care about application performance. \n",
        "StrategyId": "Auth17"
      },
      "Task1": "CssDebuggingTask",
      "Task2": "ProfilerTask",
      "Time": "10:56:26",
      "WorkExperiences": {
        "background": "I have been in the field of software development from last 5-6 years. Both of my internships are in web development. \nLindedIn Link: https://www.linkedin.com/in/hassan93 ",
        "biggestSoftware": "I developed a smart chat using C# language and socket programming in my undergrad. That was my solo project. I used cryptography algorithms such as Vigenere and RSA to make the chat secured over the network. ",
        "biggestWebApplication": "recently, I developed an application using MVC framework, JavaScript, Java Beans, HTML, CSS, JSP and Oracle SQL server. Basically, it was getting data in the form from the students and based on the entrance of data it navigates the user to a particular JSP page. For navigation, I used Servlet technology. \n",
        "softwareDevelopmentExperience": "6",
        "webDevelopmentExperience": "2",
        "webExperiencePeriod": "0 years and 7 months",
        "workExperiencePeriod": "0 years and 5 months"
      }
    },
    "Tester12": {
      "ParticipantId": "Tester12",
      "Strategy1": {
        "ChallengingToWork": "No challenges. It was pretty straightforward and well-described",
        "Clarity": "Yes, it was clear for this task, but not applicable as a general solution (where other UI technologies like SPAs are involved). Comparing to the first task, it was very easy, and mostly is a common sense for any UI developer.",
        "Missing": "Apart from other developers code that may sound confusing to find a CSS style issue, those problems may also occurs when a third-party library is added to UI applications. Such libraries may create conflict with the developer's CSS files. \nIn this strategy a step is missing to check for existing sources of external (in this case Bootstrap) libraries for possible overridden styles in Janky Movement CSS. Although in this task, the cause of the issue was the opposite (style.css was overriding expected bootstrap style), there could have been a heads-up step to watch for such overriding problems by Bootstrap.",
        "OtherChallenges": "Looking at the \"Sources\" tab in Chrome's developer view to check for the file name and location of the CSS to apply the fix to code base",
        "RequiredInfo": "I would add an extra step to watch for third-party libraries where it might override existing component styles as well.\nCSS problem solving strategies could consider external sources statements.",
        "StrategyId": "Auth14"
      },
      "Strategy2": {
        "ChallengingToWork": "Strategy is too broad and not formatted in Roboto.\nApplication is changing on client side through app.js file. I could not capture rendering changes in JMeter nor would it generate a Http response object when a button was clicked. \nBy recording UI changes through Chrome profiling, it was clear that the increasing number of animated images accounts for performance and rendering delays (Animation Frame Fire response time). However, I didn't find the relevant piece of code in Profiling responsible for this action ",
        "Clarity": "No, it was a hint rather a problem solving strategy. It requires a long Roboto strategy file instead",
        "Missing": "Detailed steps on how to configure JMeter and setting up a component listener on UI buttons",
        "OtherChallenges": "-Setting up JMeter, browser proxy and Apache certificates\n-Using Chrome's profiler to try to see for the exact place where rendering delays would occur\n-Inspecting http response with Postman",
        "RequiredInfo": "How to capture javascript changes in JMeter. ",
        "StrategyId": "Auth17"
      },
      "Task1": "CssDebuggingTask",
      "Task2": "ProfilerTask",
      "Time": "16:25:8",
      "WorkExperiences": {
        "background": "A senior software developer worked on different commercial projects as individual full stack developer, team player or technical lead. Hands-on experience in Java, shell scripting, javascript and SQL languages.\nhttps://www.linkedin.com/in/hootanv/",
        "biggestSoftware": "Integration and business flow orchestration application at enterprise level with messaging capabilities using microservices",
        "biggestWebApplication": "An ERP web application consisting of financial, logistics, commercial, and more modules. Client-side development on javascript and jquery, as well as third-party UI components (Oracle ADF). \nDevelopment was around all business related web pages in jspx format, user roles and security modules, custom component with JSTL and taglib, and more.",
        "softwareDevelopmentExperience": "10",
        "webDevelopmentExperience": "4",
        "webExperiencePeriod": "5 years and 0 months",
        "workExperiencePeriod": "9 years and 0 months"
      }
    },
    "Tester13": {
      "ParticipantId": "Tester13",
      "Strategy1": {
        "ChallengingToWork": "In overall the strategy was well written and could be easily followed. The only challenge I had, it was not clear for me if I necessarily have to reach to the answer and fix the problem or there was not need for fixing it.\nFrom the following line :\"First look at the three individual runs of the action and see if the performance is consistent\", I couldn't follow the instructions\n since I didn't know how to read the saved profiler files to check the performance and find out if it's consistent or if any improvement was there in any specific time.",
        "Clarity": "Yes, it was clear. \nJust lack of some detail information was the problem for me.",
        "Missing": "Probably a little details about reading the recorded profilers and figure out how much time each section is taking. Since the saved log files contain a lot of information and finding the relevant ones were difficult for me. ",
        "OtherChallenges": "Nothing more",
        "RequiredInfo": "Like the simple instruction given for opening the chrome developer tool (pressing F12), I was looking for something to teach me how to use the recorded files in order to find and fix the issue.",
        "StrategyId": "Auth20"
      },
      "Strategy2": {
        "ChallengingToWork": "The flow of the strategy was fine to read and understand it but it didn't help me to locate the issue.It was like a general sudo-code that was written to help a developer to handle all potential errors. But as a tester, it couldn't help me to find the issue, i found the strategy more useful for developer of the application rather than its tester.",
        "Clarity": "It was clear but in a wrong point of view, I think!",
        "Missing": "the point of view of the strategy writer as a tester. It was also too general as I said like a sudo code for me.",
        "OtherChallenges": "Nothing special",
        "RequiredInfo": "the detail of how to find the issue and fix it. I know all possible inputs from user should be checked and any potential error should be handled, but knowing how to fix if any of them is not correctly handled was something that I was expecting to be leaded by reading the strategy. ",
        "StrategyId": "Auth18"
      },
      "Task1": "ProfilerTask",
      "Task2": "ErrorHandlingTask",
      "Time": "23:55:4",
      "WorkExperiences": {
        "background": "I have experience in Java programming language and Python. Currently I'm working with Python for my research project. I've done web-application development just in a semester as the requirement of my coursework and unfortunately, I forgot most of them by now :D",
        "biggestSoftware": "All my software experience are related to my class and research projects so definitely I'm not an expert developer.",
        "biggestWebApplication": "just two class projects: a marketplace (as a member in a group 3 people) and creating a home page in university public directory",
        "softwareDevelopmentExperience": "1",
        "webDevelopmentExperience": "2",
        "webExperiencePeriod": "0 years and 3 months",
        "workExperiencePeriod": "2 years and 5 months"
      }
    },
    "Tester15": {
      "ParticipantId": "Tester15",
      "Strategy1": {
        "ChallengingToWork": "The strategy has lots of required features to be checked. First the TO key words at the beginning of the statement are a little confusing for me. It took me a while to understand they are asking me to check or share  some issues. Additionally they are very generally described. I need more descriptiona nad detail about how I should pass each feature requirements. For instance, how I should debug Css at line #8. I assume I would have a strategy to tell me how to debug CSS, but it is just a line of statement.\nAnother major challenging part could be using Github for users who are not familiar working with Github.\nGenerally speaking, all the statements are very general and high level description of the action that user should take. They need to have more detailed description of the actions user needs to take.",
        "Clarity": "Not very clear. It took me a while to understand what statements asked me to do.",
        "Missing": "Detailed description of all the statements are missing.",
        "OtherChallenges": "Generally all the statements are very challenging to understand what I should do . ",
        "RequiredInfo": "Just better description of the statemnets",
        "StrategyId": "Auth6"
      },
      "Strategy2": {
        "ChallengingToWork": "What could be possible error scenarios? How can I make sure that I cover all the scenarios? \nWhat it means by implementing a alogical flow? And how should I implement it?\nWhat does the strategy by \"Write the statements that should get executed regardless of any error scenario\" ? It is challenging as it could have many different meaning for the statement.",
        "Clarity": "It is very high level description. It is clear but not usable.",
        "Missing": "The strategy is very high level description of the steps. I need more steps including more detailed description of what I need to do and check",
        "OtherChallenges": "Many words that are used like stockholders, statement, possible error scenarios, and logical flow is used as it is a very common word that everybody should understand what it is. As I said, more description adding make it usable and less challenging",
        "RequiredInfo": "More description on what part of the code should I check and what are most probable places for errors happening|? Edge cases should be described to cover and not being missed. In general, detailed description of steps make it easier to follow to be productive.",
        "StrategyId": "Auth8"
      },
      "Task1": "CssDebuggingTask",
      "Task2": "ErrorHandlingTask",
      "Time": "13:42:17",
      "WorkExperiences": {
        "background": "I have worked in a small personal business company in which we developed the other companies requested applications.",
        "biggestSoftware": "I developed a card producer application which retrieve information of users and print a personal card for them. It was a desktop application",
        "biggestWebApplication": "A front end web application for a course work.",
        "softwareDevelopmentExperience": "6",
        "webDevelopmentExperience": "2",
        "webExperiencePeriod": "2 years and 0 months",
        "workExperiencePeriod": "4 years and 0 months"
      }
    },
    "Tester2": {
      "ParticipantId": "Tester2",
      "Strategy1": {
        "ChallengingToWork": "No, actually this was very straight forward to work with.",
        "Clarity": "Yes, it was clear. ",
        "Missing": "The following is missing 1. Make changes and see if they are appropriate. 2. Take those changes and make it back in the IDE",
        "OtherChallenges": "None",
        "RequiredInfo": "No nothing required.",
        "StrategyId": "Auth3"
      },
      "Strategy2": {
        "ChallengingToWork": "Hover over the NET section to view the CSS component utilized The above line was too confusing for me to understand and also difficult to find.",
        "Clarity": "Yes, it was a little confusing for me. But many sections were clear. The section especially finding the CSS component. I used chrome but still I was not able to find the NET section to find the CSS component. It took me a long time to find the component. Overall I meant that it was a little difficult to find the NET section while following the instructions.",
        "Missing": "The optimization is missing from this. The optimize button had no effect when I tried clicking it and I failed to understand the functionality.I was clicking on the optimize button to see what effect it has but I couldn't find any difference when I clicked it.  When You click on the screen on any button, you should get the result. I was trying to see what optimize button is doing But i couldn't see any effect after clicking the button. If the Button has no effect then the Button should not be there on the screen. ",
        "OtherChallenges": "N/A",
        "RequiredInfo": "Please try to implement as many steps as you can in the program.",
        "StrategyId": "Auth5"
      },
      "Task1": "CssDebuggingTask",
      "Task2": "ProfilerTask",
      "Time": "11:11:1",
      "WorkExperiences": {
        "background": "I am working as a web developer for the last 3 years and have developed more than 10 web applications and supporting 20+ already developed web applications.",
        "biggestSoftware": "It is about the loan application for my client.",
        "biggestWebApplication": "loan application for my client",
        "softwareDevelopmentExperience": "10",
        "webDevelopmentExperience": "4",
        "webExperiencePeriod": "3 years and 0 months",
        "workExperiencePeriod": "3 years and 0 months"
      }
    },
    "Tester5": {
      "ParticipantId": "Tester5",
      "Strategy1": {
        "ChallengingToWork": "# This Strategy helps impliment error handling for a web application --- But also some stuff about SQLi and databases?\n#Considerations\nUser input\nDatabase Errors \n#Required Knowledge\nWeb application language\nDatabase SQL\nSTRATEGY UserInput()\n# Goal is to limit free-hand input and use strong typing\nUse list-boxes as much as possible   --- What's a list-box?\nUse Try-Catch and log errors\nIF list-boxes cannot be used, validate textboxes\n    Validate datatypes for all enteries\n    IF numberic reject alpha  --- It seems like it would be ok here to specify \"alphabetical characters\". Alpha can also mean a specific symbol, if I'm being nitpicky.\n    IF date validate dates and reject invalid dates\n    IF character Check for injection (SQL and script) AND   --- How? Probably by parameterizing queries / stored procedures.\n       Check for spcial characters   --- Like what? \n    FOR EACH 'textbox' On Page\n        Validate\n    IF Error Found    \n       RETURN Error --- To user? Where?\n    ELSE\n       Submit Page\nSTRATEGY Database()\n# Handle null values, data truncation, invalid datatypes\nIn Queries check values before performing Substring functions   --- Check what about the values? Too vague to be helpful for me.\nUse stored procedures to limit SQL injection --- Don't just limit SQLi. Prevent it entirely using prepared statements or parameterized queries, which actually can prevent it. Stored procedures do not prevent SQLi by default.\nUse IsNull (or NVL) for nulls.  --- Why? In what situation? Does this mean put a string \"IsNull\" in values that will be null in the database instead of leaving them empty?\nCheck for blank values using len(trim(<columnName>)) = 0\nDO NOT USE \"where 1 = 1\" in queries as this allows for --- Factually incorrect, see below. \nSQL injection\nUse Try-Catch and log all errors --- Where? To console? To an internal error log? To somewhere only developers can see? No consideration for what errors to be logged to the user. \n",
        "Clarity": "\"Use list-boxes as much as possible\" -- I don't know what a list box is.\nThis lacks explanation of why the things in the strategy would be done.",
        "Missing": "More detail on what to do, ex. \"check\" what? Security depth of knowledge is also missing, especially around SQL injection.",
        "OtherChallenges": "It is incorrect to state \"DO NOT USE \"where 1 = 1\" in queries as this allows for SQL injection\". This DOES NOT allow for SQL injection inherently. \"1=1\" is a common attack string when testing for SQL injection, but including that as part of a query does not make you any more vulnerable if you have otherwise parameterized your query. source: I am a security engineer...",
        "RequiredInfo": "See above.",
        "StrategyId": "Auth9"
      },
      "Strategy2": {
        "ChallengingToWork": "I wasn't able to change the background color to a random color using this strategy, since it's CSS specific and I think that would need to happen in the JavaScript to set the CSS. However, this can help narrow down which style piece needs to be adjusted to set a color like that.\n\nI usually inspect elements by clicking on them and then opening the editor. I can't easily right click on the quickly moving boxes-- I need them to be moving slower to click on. Thus, I would not have been able to resolve this if I hadn't gone to look at the source HTML of the page and select an individual box.",
        "Clarity": "I think it's fine in clarity. Needs a spell check though.",
        "Missing": "See below.",
        "OtherChallenges": "n/a",
        "RequiredInfo": "This strategy is primarily applicable with Google Chrome. There should be a note on it stating the specific capabilities GC has that allow this strategy to be used. Be explicit about browser capabilities so that it saves people time.\n\n\"element.Style\" -- this is just setting the style property. It might be useful to say how to do that in a bit more detail, or to say something like style property instead of element.Style.",
        "StrategyId": "Auth13"
      },
      "Task1": "ErrorHandlingTask",
      "Task2": "CssDebuggingTask",
      "Time": "21:19:2",
      "WorkExperiences": {
        "background": "Backend developer + new security engineer. Teaching assistant in R class 3x. Teaching assistant in Python data science class 2x. Teaching assistant in Django Python backend course 1x. Informatics student at University of Washington. ",
        "biggestSoftware": "n/a",
        "biggestWebApplication": "Reviewing application using Firebase and React. Create, edit, delete reviews. User login / logout / signup. ",
        "softwareDevelopmentExperience": "0",
        "webDevelopmentExperience": "6",
        "webExperiencePeriod": "1 years and 6 months",
        "workExperiencePeriod": "0 years and 0 months"
      }
    },
    "Tester6": {
      "ParticipantId": "Tester6",
      "Strategy1": {
        "ChallengingToWork": "line 14 'numberic' --> 'numeric'.   Problem is incomplete json file, but instructions don’t mention to check json file",
        "Clarity": "yes it was clear.",
        "Missing": "if statements in the Database() section. more imperative statements instead of functional statements. Never said to check json file. Incomplete data in json file is why some data is displaying while others is not.",
        "OtherChallenges": "n/a",
        "RequiredInfo": "color coding headers . more if statements/ imperative statements",
        "StrategyId": "Auth9"
      },
      "Strategy2": {
        "ChallengingToWork": "The ‘fixCSS’ section seems overly vague. For example this line is not clear to me.         SET 'undesiredStyling' TO the line number and css file found in the search. This  task the html had a typo ( The title was red because ‘class’ was misspelled ‘calss’) and the css file had an extra line that made the background of the buttons beige instead of the colors they are supposed to be. The instructions provide a nice outline of what to do. ",
        "Clarity": "yes it is clear. ",
        "Missing": "color coding or some sort of clearer directions. ",
        "OtherChallenges": "no other challenges",
        "RequiredInfo": "more elaboration in the STRATEGY ApplyCssToElement(element, style) section. More elaboration on how to find the issue in the js code or how to get the rainbow borders for the blue squares. ",
        "StrategyId": "Auth13"
      },
      "Task1": "ErrorHandlingTask",
      "Task2": "CssDebuggingTask",
      "Time": "12:54:27",
      "WorkExperiences": {
        "background": "https://github.com/mkMcMahon\n\nwww.matthewkmcmahon.com",
        "biggestSoftware": "software to test and evaluate different market conditions. needed complex front and back end. multiple types of front end users so many interfaces. ",
        "biggestWebApplication": "booking and scheduling app for private company",
        "softwareDevelopmentExperience": "4",
        "webDevelopmentExperience": "2",
        "webExperiencePeriod": "5 years and 0 months",
        "workExperiencePeriod": "7 years and 0 months"
      }
    },
    "Tester7": {
      "ParticipantId": "Tester7",
      "Strategy1": {
        "ChallengingToWork": "Some slight ambiguity regarding the information and explanation regarding the code actions in listed in the expert strategy text. I thought the statements \"SET 'wrongCSSElements' to the elements that have wrong styling appliedFOR EACH 'wrongCSSElement' IN 'wrongCSSElements'\" didn't make much sense and it took me a few more minutes to firmly understand it.",
        "Clarity": "I thought the strategy I used was clear to some extent. The statements surrounding the wrong CSS elements threw me off guard because of the ambiguity but other than that there really wasn't any more challenges I would say/ ",
        "Missing": "I think more specific context regarding the preconditions and statements would be better. What is missing here is the same with what the first programming task is missing. ",
        "OtherChallenges": "None",
        "RequiredInfo": "Color coding would be better in pointing out which statements are explanations or coding actions. ",
        "StrategyId": "Auth1"
      },
      "Strategy2": {
        "ChallengingToWork": "What made it challenging to work with this strategy was the fact that the approach didn't make sense to me. Assuming the back-end doesn't work at all is one good way to first approach this issue, but I believe beginning this mindset first may be limiting for other users as they just want to get straight to the point in terms of fixing the issue. I think the first line to insert code, line 24, presented a challenge as it wasn't specific enough nor did it provide insight on why inserting error handling on the timeout was necessary. ",
        "Clarity": "No I do not think so. I believe the information surrounding the first action presented was ambiguous and lacked clarity. I also believe the statements and actions surrounding line 40 where I am told to insert the error list did not make enough sense especially the statement \"This does not always mean a failure. You will need to decide on context whether to stop the application here, or proceed\"\n            ",
        "Missing": "More steps and more specific terms as to what errors can arise and why are they caused. I believe color-coding would be extremely crucial as it would be visibly easier to see for the user in terms of what is code, preconditions, statements, and actions.",
        "OtherChallenges": "None",
        "RequiredInfo": "Like I mentioned before, I believe that color-coding would and more explanation regarding preconditions and actions would be more suitable in order for one to better understand and follow this strategy. ",
        "StrategyId": "Auth7"
      },
      "Task1": "CssDebuggingTask",
      "Task2": "ErrorHandlingTask",
      "Time": "0:34:24",
      "WorkExperiences": {
        "background": "I've taken several programming classes ranging from front end development like HTML/CSS, JavaScript, to back end like SQL and JAVA.\nhttps://github.com/Jose08101",
        "biggestSoftware": "The biggest software application I have developed is an application that searches senators, and mayors given on a city or zip code that is typed in the search bar. ",
        "biggestWebApplication": "The biggest web application I have developed is an application that searches senators, and mayors given on a city or zip code that is typed in the search bar. ",
        "softwareDevelopmentExperience": "0",
        "webDevelopmentExperience": "3",
        "webExperiencePeriod": "1 years and 0 months",
        "workExperiencePeriod": "1 years and 0 months"
      }
    },
    "Tester8": {
      "ParticipantId": "Tester8",
      "Strategy1": {
        "ChallengingToWork": "The boxes were moving very fast and it was almost impossible to right click on them. I had to go through the DOM hierarchy to find them.",
        "Clarity": "The strategy was easy to follow. ",
        "Missing": "I think, in this case, animated elements were not considered in this strategy. Plus, only external styling was specified. Also, I could not find the issue with the header class in the dev tools, which happens to be a typo \"calss\" in the html",
        "OtherChallenges": "Nothing",
        "RequiredInfo": "Some explanation on how to debug edge cases could make it easier to follow, like how to debug animated elements or how to debug when element's style is manipulated with js. Also, debugging on inline styling could be helpful. ",
        "StrategyId": "Auth1"
      },
      "Strategy2": {
        "ChallengingToWork": "Some statements were vague like the line \"If the timeout is not defined in a central, configurable location\" and its \"Code:\" part. Also the block with \"syntax or casing\", was not clear at first glance. ",
        "Clarity": "Overall, The strategy was clear, well organized and easy to follow. ",
        "Missing": "I think some of the \"Code:\" lines needed more details or explanation. ",
        "OtherChallenges": "Nothing",
        "RequiredInfo": "I think it would make it much easier to follow if there were some elaborations on some lines with more comments or example comments. It was much easier much easier to understand the lines with comments specially with example comments.",
        "StrategyId": "Auth7"
      },
      "Task1": "CssDebuggingTask",
      "Task2": "ErrorHandlingTask",
      "Time": "22:54:22",
      "WorkExperiences": {
        "background": "I am senior software developer in Old Dominion University and I am involved in many active development projects, such as Student attendance system, web portal application development and CI/CD projects. \nMy LinkedIn url: https://www.linkedin.com/in/meysam-abolghasemi-7b867998/\n",
        "biggestSoftware": "Student portal web app amongst others. It involved on implementing a micro-service architecture to integrate the portal with many different services in the university. ",
        "biggestWebApplication": "Same as above ",
        "softwareDevelopmentExperience": "10",
        "webDevelopmentExperience": "7",
        "webExperiencePeriod": "5 years and 0 months",
        "workExperiencePeriod": "5 years and 0 months"
      }
    }
  }
}